posts/contrasts-and-multiple-testing/index.html
<!DOCTYPE html>
<html prefix="        og: http://ogp.me/ns# article: http://ogp.me/ns/article#     " vocab="http://ogp.me/ns" lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width">
<title>Contrasts and Multiple Testing | Bits of Experience</title>
<link href="https://fonts.googleapis.com/css?family=Bitter:400,400i,700" rel="stylesheet" type="text/css">
<link rel="stylesheet" href="https://use.fontawesome.com/releases/v5.0.13/css/all.css" integrity="sha384-DNOHZ68U8hZfKXOrtjWvjxusGo9WQnrNx2sqG0tfsghAvtVlRW3tvkXWZh58N9jp" crossorigin="anonymous">
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" hreflang="en" href="../../rss.xml">
<link rel="canonical" href="https://marcohassan.github.io/bits-of-experience/posts/contrasts-and-multiple-testing/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Marco Hassan">
<link rel="prev" href="../one-way-analysis-of-variance/" title="One-way Analysis of Variance" type="text/html">
<link rel="next" href="../monitor-driver-thinkpad-dock-usb-30/" title="Monitor Driver ThinkPad Dock-USB 3.0" type="text/html">
<meta property="og:site_name" content="Bits of Experience">
<meta property="og:title" content="Contrasts and Multiple Testing">
<meta property="og:url" content="https://marcohassan.github.io/bits-of-experience/posts/contrasts-and-multiple-testing/">
<meta property="og:description" content="So far in the ANOVA series we have encountered a simple one-way
analysis of variance test. This was based on the idea of comparing the
standardized sum of squares of the treatment effect and the one o">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2019-10-09T18:02:38+02:00">
<meta property="article:tag" content="ANOVA">
</head>
<body>
    <a href="#page-content" class="sr-only sr-only-focusable">Skip to main content</a>
    
    <section class="social"><ul>
<li><a href="../../pages/aboutme/" title="About me"><i class="fa fa-user"></i></a></li>
            <li><a href="../../pages/bits-of-experience-a-readable-view-on-my-study-adventures/" title="Home"><i class="fa fa-home"></i></a></li>
            <li><a href="../../index.html" title="Blog"><i class="fa fa-folder-open"></i></a></li>
            <li><a href="../../categories/index.html" title="Tags"><i class="fa fa-tags"></i></a></li>
            <li><a href="https://github.com/MarcoHassan" title="My Github"><i class="fab fa-github"></i></a></li>
            <li><a href="../../rss.xml" title="RSS"><i class="fa fa-rss"></i></a></li>
    
    

        </ul></section><section class="page-content"><div class="content" rel="main">
            
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">Contrasts and Multiple Testing</a></h1>

        <div class="metadata">
            <p class="dateline"><a href="." rel="bookmark"><i class="fa fa-clock"></i> <time class="published dt-published" datetime="2019-10-09T18:02:38+02:00" itemprop="datePublished" title="2019-10-09 18:02">2019-10-09 18:02</time></a></p>
            <p class="byline author vcard"> <i class="fa fa-user"></i> <span class="byline-name fn" itemprop="author">
                    Marco Hassan
            </span></p>
            
        <p class="sourceline"><a href="index.org" class="sourcelink"><i class="fa fa-file-code"></i> Source</a></p>

            

            
    <div class="tags">
<h3 class="metadata-title">
<i class="fa fa-tags"></i> Tags:</h3>
        <ul itemprop="keywords" class="tags-ul">
<li><a class="tag p-category" href="../../categories/anova/" rel="tag">ANOVA</a></li>
        </ul>
</div>

        </div>
    </header><div class="e-content entry-content" itemprop="articleBody text">
    <br><br><p>
So far in the <i>ANOVA</i> series we have encountered a simple one-way
analysis of variance test. This was based on the idea of comparing the
standardized sum of squares of the treatment effect and the one of the
stochastic component. We did this with the <i>omnibus</i> F-test testing
the null of no-effect of the treatments.
</p>

<p>
What happens however when we have a rather specific question, such as
the when we are concerned about the effect of a specific
treatment/factor and we question whether this is significant?
</p>

<!-- TEASER_END -->

<br><div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Setting up Hypothesis</h2>
<div class="outline-text-2" id="text-1">
<p>
In order to address our specific question we must set up an
hypothesis. In this sense, we can formulate a vector containing our
hypothesis.
</p>

<p>
For instance assuming a dataset containing a factor with three levels
such as the one encountered in the previous post. We might be
interested in comparing the mean of two of the levels of the factor.
We might then set up the hypothesis
</p>

\begin{align*}
  \vec{c} = \begin{pmatrix} 1 \\ -1 \\ 0\end{pmatrix} ; &amp; \hspace{10mm} \vec{\alpha} = \begin{pmatrix} \alpha_1 \\ \alpha_2 \\ \alpha_3 \end{pmatrix} \\ 

  \\

  H_0: \vec{c}^\intercal * \vec{\alpha} &amp;= 0  \\

  H_A: \vec{c}^\intercal * \vec{\alpha} &amp;\neq 0 
\end{align*}

<br><p>
In the above case, we expressed the Null of equal treatment effects
for the two first levels. In an analogous way we can formulate any
other linear hypothesis.
</p>

<p>
Notice that the above is called a contrast and we usually provide a
side-constraint such that we ensure that the contrast above is testing
the difference among the treatments rather than the overall level of
the response. 
</p>

<p>
$$\sum^{m}_{i=1} c_i = 0$$
</p>

<p>
Notice however that if we are interested in the testing the difference
in levels of the treatment groups a Null as:
</p>

<p>
$$\vec{c} = \begin{pmatrix} 1 \\ 2 \\ 0 \end{pmatrix}$$
</p>

<p>
might make completely sense.
</p>

<br>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Analysis of Variance and F-tests</h2>
<div class="outline-text-2" id="text-2">
<p>
It is possible to demonstrate that every contrast is associated with
a sum of squares:
</p>

<p>
\[ SS_c = \frac{(\sum^{m}_{i=1} c_i 1/n_i \sum^{n_i}_{j=1} y_{ij})^2}{\sum^{m}_{i=1} \frac{c_i^2}{n_i}}  \]
</p>


<p>
having <i>one degree of freedom</i>. Notice, that above the nominator
represents the squared treatment group mean, weighted by the contrast
weight assigned to each group. The nominator is then weighted by being
multiplied by the number of observations in each group normalized by
the contrast weight.
</p>

<p>
It is then possible to see that under the null hypothesis it holds
</p>

<p>
$$\frac{MS_c}{MS_E} = \frac{SS_c}{MS_E} \mathtt{\sim} F_{1,N-m}$$
</p>
</div>
</div>


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Orthogonal, Non-redundant Contrasts</h2>
<div class="outline-text-2" id="text-3">
<p>
A particularly interesting family of contrasts are orthogonal
contrasts. These are non redundant contrasts. 
</p>

<p>
Two contrasts \(c\) and \(c^{*}\) are orthogonal when it holds:
</p>

<p>
\[ \sum_{i = 1}^{m} \frac{c_i * c_i^{*}}{n_i} = 0\]
</p>


<p>
Then no information contained in one contrast is present in a second
and contrasts are therefore non-redundant. To see that consider the
toy example:
</p>

<p>
\[ \psi_1  =   \begin{pmatrix} 1 \\ 1 \\ 0\end{pmatrix}  \hspace{10mm}   \psi_2  = \begin{pmatrix} 0 \\ 0 \\ 1\end{pmatrix} \hspace{10mm}  \psi_3  = \begin{pmatrix} 1 \\ 0 \\ 1\end{pmatrix}  \]
</p>

<p>
Then, ψ<sub>3</sub> is a redundant contrast and having it or not does not add
any info to the experimenter.
</p>

<p>
What is important now is that given our <i>m</i> treatments, we can always
find <i>m-1</i> orthogonal treatments; this because one dimension is
already occupied by the global mean, where we constrain \(c = (1,
...., 1)^\intercal\). Given those, we individual sum of squares for
individual contrasts are independent by definition and the total
<i>treatment sum of squares</i> can be rewritten as the sum of the
individual contrasts.
</p>

<p>
$$ SS_{c_1} + .... + SS_{c_m} = SS_{Trt} $$ 
</p>

<p>
<b>This means that posing the right <i>m-1</i> questions about the treatment
you get all the information that is involved with the it.</b> 
</p>

<br>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Testing Multiple Contrasts</h2>
<div class="outline-text-2" id="text-4">
<p>
While using contrasts is a neat tool to test a set of linear
hypothesis one should be careful, when repeatedly testing multiple
contrasts hypothesis.
</p>

<p>
For instance, when testing <i>j</i> independent Null \(H_{0,j}\) with
confidence α, the probability of rejecting at least one Null when
<i>all of the Null are correct</i> is
</p>

<p>
$$ 1 - (1-a)^j$$
</p>

<p>
It is straightforward to see that such probability tends to one, no
matter how high the confidence as j gets large.
</p>

<p>
This requires a way to holistically handle all of the different
Nulls. This is the topic of the chapter.
</p>

<p>
In this sense, it is of use looking at the <i>family-wise error
rate</i>. This expresses the /probability of rejecting at least one of
the true H<sub>0</sub> [V] /:  
</p>

<p>
$$ FWER = P(V \geq 1). $$
</p>

<p>
Given the above definition we say that <b>a procedure controls the
family-wise error rate in the strong sense</b> at level α iff:
</p>

<p>
$$ FWER = P(V \geq 1) \leq \alpha. $$
</p>

<br>
</div>

<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1">FWER and FDR</h3>
<div class="outline-text-3" id="text-4-1">
<p>
An important by product results that naturally emerges is that when
controlling the family-wise error rate in the strong sense, we
automatically bound the <i>false discovery rate (FDR)</i>  defined as:
</p>

<p>
$$ FDR = \frac{number\ of\ rejected\ Null\ where\ the\ Null\ was
correct}{total\ number\ of\ rejected\ Null} = fraction\ of\ wrongly\ rejected\
Null$$
</p>

<p>
This concretely means that when bounding the FWER to α we
automatically bound the FDR to α.
</p>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2">FWER and Confidence Intervals</h3>
<div class="outline-text-3" id="text-4-2">
<p>
We can extend the concept of FWER to confidence intervals. This should
then express the probability that <i>all intervals</i> cover the
corresponding true parameter value is (1 - α). This means that
when looking at all the confidence intervals simultaneously we should
should get a probability of (1-α) of capturing the true
parameter. The concept is defined as <b>simultaneous confidence
intervals</b>. 
</p>

<p>
Notice, that in the above cases, we typically start with “individual”
p-values that we modify (or adjust) such that the appropriate overall
error rate (like FWER) is being controlled. Interpretation of an
individual p-value is as you learned it in your introductory course
(“the probability to observe an event as extreme as …”). The modified
p-values should be interpreted as the smallest overall error rate such
that we can reject the corresponding null hypothesis. 
</p>
</div>
</div>

<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3">Bonferroni</h3>
<div class="outline-text-3" id="text-4-3">
<p>
This is a rather generic but very conservative approach and it
obviates to compute the exact FWER and Simultaneous Confidence
Interval introduced above.
</p>

<p>
It consists of using the rather restrictive <b>individual</b> significance
level \(a^{*} = \frac{a}{m}\). This will control the <i>family-wise error
rate</i> in the strong sense albeit being quite restrictive. 
</p>

<p>
Moreover, the confidence intervals based on the adjusted significance
level are <i>simultaneous</i>.
</p>
</div>
</div>

<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4">Bonferroni-Holm</h3>
<div class="outline-text-3" id="text-4-4">
<p>
This is generally <i>less conservative</i> and uniformly more powerful than
Bonferroni. 
</p>

<p>
It works as follows:
</p>

<ol class="org-ol">
<li>Sort p-values from the smallest to the largest: $p<sub>(1)</sub> ≤
   … ≤ p<sub>(j)</sub> $
</li>

<li>for i = 1,2 ….: Reject the Null if \(p_{(i)} \leq \frac{a}{m-i+1}\)
</li>

<li>stop when reaching the first non-significant p-value.
</li>
</ol>
<p>
Notice therefore that under Bonferroni-Holm the higher p-values are
compared with lower confidence levels. This has therefore a relaxing
effect in comparison to the standard Bonferroni test.
</p>
</div>
</div>

<div id="outline-container-sec-4-5" class="outline-3">
<h3 id="sec-4-5">Scheffé</h3>
<div class="outline-text-3" id="text-4-5">
<p>
The Scheffé procedure controls for the search over <i>any possible
contrast</i>. This means that we can try out as many contrasts as we like
and still get honest p-values. This comes, however at the expense of
low power. That is of a <i>low probability of rejecting when the
alternative is right</i>.  Scheffé contains therefore, the issue of a
Type I error at the expense of a higher probability of committing Type
II errors.
</p>

<p>
The Scheffé procedure works as follows:
</p>

<ol class="org-ol">
<li>Calculate the F-ratio as if ordinary contrast 
</li>

<li>use the distribution $ (m-1) F<sub>m-1, N-m</sub>$ instead of \(F_{m-1,
   N-m}\) to calculate p-values.
</li>
</ol>
</div>
</div>


<div id="outline-container-sec-4-6" class="outline-3">
<h3 id="sec-4-6">Tukey Honest Significance Difference</h3>
<div class="outline-text-3" id="text-4-6">
<p>
A special case for a multiple testing problem is when comparing
between all possible pairs of treatments. 
</p>

<p>
Overall, there are \(frac{m* (m-1)}{2}\) treatment pairs that we can
compare. When testing all such different pairs we could proceed by
calculating the pairwise F-statistics and applying <i>Bonferroni-Holm</i>
to obtain the p-values.
</p>

<p>
A more <i>powerful</i> approach in such case consists in applying the
<i>Tukey Honest Significant Difference</i>. This is custom tailored for
this test design and the details were omit in the class script.
</p>
</div>
</div>


<div id="outline-container-sec-4-7" class="outline-3">
<h3 id="sec-4-7">Multiple Comparison with a Control (MCC)</h3>
<div class="outline-text-3" id="text-4-7">
<p>
This is in a similar spirit as the Tukey Honest Significance
difference above. It is a high <i>power</i> test for comparing the all the
treatment groups with an overall control group.
</p>

<p>
The corresponding test yielding the best p-values in such a case is
called <i>Dunnett procedure</i> and might be further inspected inc ase of
interest.
</p>
</div>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul class="pager hidden-print">
<li class="previous">
                <a href="../one-way-analysis-of-variance/" rel="prev" title="One-way Analysis of Variance">Previous post</a>
            </li>
            <li class="next">
                <a href="../monitor-driver-thinkpad-dock-usb-30/" rel="next" title="Monitor Driver ThinkPad Dock-USB 3.0">Next post</a>
            </li>
        </ul></nav></aside><script src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.1/MathJax.js?config=TeX-AMS-MML_HTMLorMML" integrity="sha256-SDRP1VVYu+tgAGKhddBSl5+ezofHKZeI+OzxakbIe/Y=" crossorigin="anonymous"></script><script type="text/x-mathjax-config">
MathJax.Hub.Config({
    tex2jax: {
        inlineMath: [ ['$','$'], ["\\(","\\)"] ],
        displayMath: [ ['$$','$$'], ["\\[","\\]"] ],
        processEscapes: true
    },
    displayAlign: 'center', // Change this to 'left' if you want left-aligned equations.
    "HTML-CSS": {
        styles: {'.MathJax_Display': {"margin": 0}}
    }
});
</script></article><footer id="footer"><p>Contents © 2019         <a href="mailto:marco.hassan30@gmail.com">Marco Hassan</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         </p>
            
        </footer>
</div>
    </section><script src="../../assets/js/all-nocdn.js"></script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(2, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates --><script>
    baguetteBox.run('div#content', {
        ignoreClass: 'islink',
        captions: function(element) {
            return element.getElementsByTagName('img')[0].alt;
    }});
    </script>
</body>
</html>
